openfoam_naca/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          137728;
        startFace       137229;
    }
    farfield
    {
        type            patch;
        nFaces          794;
        startFace       274957;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          204;
        startFace       275751;
    }
)

// ************************************************************************* //
