openfoam_naca/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.8748858925089458 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.8748858925089458 10.0 0)
    (21.0 10.0 0)
    (21.0 -2.5609659148798882 0)
    (21.0 -2.6609659148798883 0)
    (21.0 -2.7609659148798884 0)
    (1.026502997866462 0.09642401725758122 0)
    (1.0 0.0 0)
    (1.0006053567871234 -0.09999816769901479 0)
    (0.2408559162681087 0.19337867718601515 0)
    (0.25 0.09379762611351358 0)
    (0.25 -0.02507517846586733 0)
    (0.2591440837318913 -0.1246562295383689 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.8748858925089458 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.8748858925089458 10.0 1)
    (21.0 10.0 1)
    (21.0 -2.5609659148798882 1)
    (21.0 -2.6609659148798883 1)
    (21.0 -2.7609659148798884 1)
    (1.026502997866462 0.09642401725758122 1)
    (1.0 0.0 1)
    (1.0006053567871234 -0.09999816769901479 1)
    (0.2408559162681087 0.19337867718601515 1)
    (0.25 0.09379762611351358 1)
    (0.25 -0.02507517846586733 1)
    (0.2591440837318913 -0.1246562295383689 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (167 91 1) simpleGrading (12.84260814271942 57.59828112515767 57.59828112515767 12.84260814271942 0.012162813885540929 0.012162813885540929 0.012162813885540929 0.012162813885540929 1 1 1 1)
    hex (3 2 13 17 22 21 32 36) (73 91 1) simpleGrading (0.8043442555552571 1.9059828360001354 1.9059828360001354 0.8043442555552571 0.012272992486406514 0.012162813885540929 0.012162813885540929 0.012272992486406514 1 1 1 1)
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.012162813885540929 0.012272992486406514 0.012272992486406514 0.012162813885540929 1 1 1 1)
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.012162813885540929 0.012384120925045617 0.012384120925045617 0.012162813885540929 0.0125 0.5 0.5 0.0125 1 1 1 1)
    hex (14 11 6 5 33 30 25 24) (69 91 1) edgeGrading (0.3738560805335002 0.8043442555552571 0.8043442555552571 0.3738560805335002 80.74856552616524 82.21781648642946 82.21781648642946 80.74856552616524 1 1 1 1)
    hex (11 8 7 6 30 27 26 25) (167 91 1) simpleGrading (57.59828112515767 12.84260814271942 12.84260814271942 57.59828112515767 82.21781648642946 82.21781648642946 82.21781648642946 82.21781648642946 1 1 1 1)
    hex (12 9 8 11 31 28 27 30) (167 37 1) simpleGrading (57.59828112515767 6.081406942770463 1)
    hex (15 12 11 14 34 31 30 33) (69 37 1) edgeGrading (0.8 0.3738560805335002 0.3738560805335002 0.8 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1)
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2 0.5 0.5 2 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1)
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2 2 0.5 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1)
    hex (17 13 12 16 36 32 31 35) (73 37 1) edgeGrading (1.9059828360001354 0.8 0.8 1.9059828360001354 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1)
    hex (13 10 9 12 32 29 28 31) (167 37 1) simpleGrading (57.59828112515767 0.16443563297285893 1)
);

edges
(
    polyLine 11 14
    (
        (1.024150782588594 0.09837061734695651 0)
        (1.0163823377226777 0.10050553615646773 0)
        (1.0034372577149009 0.10400882563352154 0)
        (0.9854856140915844 0.10875648734230184 0)
        (0.962697533034922 0.11460146909464553 0)
        (0.9352896299711204 0.12136755756037565 0)
        (0.9035231528338007 0.12885700823873075 0)
        (0.8677015528957 0.1368580450281846 0)
        (0.8281675267449513 0.14515162295694609 0)
        (0.785299638557434 0.15351706325310244 0)
        (0.7395086734035349 0.16173643534791338 0)
        (0.6912338734530983 0.16959782700106601 0)
        (0.6409391630224005 0.17689786248883754 0)
        (0.5891093807521319 0.1834439585439342 0)
        (0.5362464236559158 0.1890568219240283 0)
        (0.48286509004283973 0.1935735832466574 0)
        (0.42937736935238763 0.19685711494244262 0)
        (0.3754172219933996 0.19869625028625937 0)
        (0.32158359533524183 0.19843459367120983 0)
        (0.26933004707928465 0.19596737983221338 0)
    )
    polyLine 30 33
    (
        (1.024150782588594 0.09837061734695651 1)
        (1.0163823377226777 0.10050553615646773 1)
        (1.0034372577149009 0.10400882563352154 1)
        (0.9854856140915844 0.10875648734230184 1)
        (0.962697533034922 0.11460146909464553 1)
        (0.9352896299711204 0.12136755756037565 1)
        (0.9035231528338007 0.12885700823873075 1)
        (0.8677015528957 0.1368580450281846 1)
        (0.8281675267449513 0.14515162295694609 1)
        (0.785299638557434 0.15351706325310244 1)
        (0.7395086734035349 0.16173643534791338 1)
        (0.6912338734530983 0.16959782700106601 1)
        (0.6409391630224005 0.17689786248883754 1)
        (0.5891093807521319 0.1834439585439342 1)
        (0.5362464236559158 0.1890568219240283 1)
        (0.48286509004283973 0.1935735832466574 1)
        (0.42937736935238763 0.19685711494244262 1)
        (0.3754172219933996 0.19869625028625937 1)
        (0.32158359533524183 0.19843459367120983 1)
        (0.26933004707928465 0.19596737983221338 1)
    )
    polyLine 14 18
    (
        (0.21928688198819438 0.1913723466302434 0)
        (0.17195952236797837 0.18478584851726523 0)
        (0.12778287604793306 0.17638623451653018 0)
        (0.0870890123554148 0.1663655022353612 0)
        (0.05006030106867333 0.15487783506711 0)
        (0.016653983264278374 0.14193892665691424 0)
        (-0.013526325865990368 0.1272017737871138 0)
        (-0.04141987036023734 0.10938113857754378 0)
        (-0.06842230508386139 0.08465997916944248 0)
        (-0.09304408505741418 0.04359139028491833 0)
        (-0.09957822924795724 0.009174762113606776 0)
    )
    polyLine 33 37
    (
        (0.21928688198819438 0.1913723466302434 1)
        (0.17195952236797837 0.18478584851726523 1)
        (0.12778287604793306 0.17638623451653018 1)
        (0.0870890123554148 0.1663655022353612 1)
        (0.05006030106867333 0.15487783506711 1)
        (0.016653983264278374 0.14193892665691424 1)
        (-0.013526325865990368 0.1272017737871138 1)
        (-0.04141987036023734 0.10938113857754378 1)
        (-0.06842230508386139 0.08465997916944248 1)
        (-0.09304408505741418 0.04359139028491833 1)
        (-0.09957822924795724 0.009174762113606776 1)
    )
    polyLine 18 17
    (
        (-0.05463291343132221 -0.08894623708963283 0)
        (-0.032545425267302204 -0.10364021925998196 0)
        (7.366463255122427e-05 -0.11638386068123231 0)
        (0.030313246357309153 -0.12297476623682138 0)
        (0.060851782713396224 -0.12662753316631775 0)
        (0.09306057349581813 -0.12847039396401533 0)
        (0.1275165050398467 -0.12899981664265056 0)
        (0.1643835265969586 -0.128514582647834 0)
        (0.20360695768245896 -0.12725373891848485 0)
        (0.24501080821402169 -0.12544247352634333 0)
    )
    polyLine 37 36
    (
        (-0.05463291343132221 -0.08894623708963283 1)
        (-0.032545425267302204 -0.10364021925998196 1)
        (7.366463255122427e-05 -0.11638386068123231 1)
        (0.030313246357309153 -0.12297476623682138 1)
        (0.060851782713396224 -0.12662753316631775 1)
        (0.09306057349581813 -0.12847039396401533 1)
        (0.1275165050398467 -0.12899981664265056 1)
        (0.1643835265969586 -0.128514582647834 1)
        (0.20360695768245896 -0.12725373891848485 1)
        (0.24501080821402169 -0.12544247352634333 1)
    )
    polyLine 17 13
    (
        (0.2883479332167103 -0.12330526940829188 0)
        (0.33332629876481956 -0.12106563105186283 0)
        (0.37968771459008593 -0.11893690211967267 0)
        (0.42799068975102683 -0.11702212738393011 0)
        (0.47787538148309183 -0.1149943292171032 0)
        (0.5279956404132607 -0.11291481877448412 0)
        (0.5777952180659672 -0.110895574722884 0)
        (0.6268143443251613 -0.10902031953381981 0)
        (0.674590880269225 -0.10734681789144454 0)
        (0.7206646198027062 -0.10590747284221859 0)
        (0.7645818392920902 -0.10471201877710853 0)
        (0.805900122724404 -0.10375178381037585 0)
        (0.844193481279446 -0.10300484728062881 0)
        (0.8790577765013448 -0.10244138219242507 0)
        (0.9101164296144717 -0.10202854415351915 0)
        (0.9370263493661264 -0.10173442866036957 0)
        (0.9594839406867649 -0.10153083533027853 0)
        (0.9772309787765299 -0.10139481081661567 0)
        (0.9900600654622005 -0.10130915033232003 0)
        (0.9978268954568863 -0.10126214000966811 0)
    )
    polyLine 36 32
    (
        (0.2883479332167103 -0.12330526940829188 1)
        (0.33332629876481956 -0.12106563105186283 1)
        (0.37968771459008593 -0.11893690211967267 1)
        (0.42799068975102683 -0.11702212738393011 1)
        (0.47787538148309183 -0.1149943292171032 1)
        (0.5279956404132607 -0.11291481877448412 1)
        (0.5777952180659672 -0.110895574722884 1)
        (0.6268143443251613 -0.10902031953381981 1)
        (0.674590880269225 -0.10734681789144454 1)
        (0.7206646198027062 -0.10590747284221859 1)
        (0.7645818392920902 -0.10471201877710853 1)
        (0.805900122724404 -0.10375178381037585 1)
        (0.844193481279446 -0.10300484728062881 1)
        (0.8790577765013448 -0.10244138219242507 1)
        (0.9101164296144717 -0.10202854415351915 1)
        (0.9370263493661264 -0.10173442866036957 1)
        (0.9594839406867649 -0.10153083533027853 1)
        (0.9772309787765299 -0.10139481081661567 1)
        (0.9900600654622005 -0.10130915033232003 1)
        (0.9978268954568863 -0.10126214000966811 1)
    )
    spline 12 15
    (
        (0.9976477847221321 0.001946600089375287 0)
        (0.9901141451468484 0.004017287862703246 0)
        (0.9776334124570569 0.007395360889163885 0)
        (0.9603187180729597 0.011975149550412803 0)
        (0.938328568194342 0.017616142613787737 0)
        (0.9118666710498651 0.024149426559141204 0)
        (0.8811813711474332 0.031384731200186644 0)
        (0.8465645470590569 0.03911743430642922 0)
        (0.8083498867125661 0.04713498588166787 0)
        (0.7669105240014849 0.055222401822034986 0)
        (0.7226560832404031 0.06316671279177795 0)
        (0.6760292164108501 0.07076049395212335 0)
        (0.6275017223467878 0.07780479921955824 0)
        (0.5775703074454792 0.08411194060800534 0)
        (0.5267519952916008 0.08950856312441449 0)
        (0.4755791368621485 0.0938393620071612 0)
        (0.4245939356659763 0.09697158665046379 0)
        (0.3739282844724455 0.09870733557538405 0)
        (0.32414429233720543 0.09846738489321036 0)
        (0.27620806825331035 0.09620419611833195 0)
    )
    spline 31 34
    (
        (0.9976477847221321 0.001946600089375287 1)
        (0.9901141451468484 0.004017287862703246 1)
        (0.9776334124570569 0.007395360889163885 1)
        (0.9603187180729597 0.011975149550412803 1)
        (0.938328568194342 0.017616142613787737 1)
        (0.9118666710498651 0.024149426559141204 1)
        (0.8811813711474332 0.031384731200186644 1)
        (0.8465645470590569 0.03911743430642922 1)
        (0.8083498867125661 0.04713498588166787 1)
        (0.7669105240014849 0.055222401822034986 1)
        (0.7226560832404031 0.06316671279177795 1)
        (0.6760292164108501 0.07076049395212335 1)
        (0.6275017223467878 0.07780479921955824 1)
        (0.5775703074454792 0.08411194060800534 1)
        (0.5267519952916008 0.08950856312441449 1)
        (0.4755791368621485 0.0938393620071612 1)
        (0.4245939356659763 0.09697158665046379 1)
        (0.3739282844724455 0.09870733557538405 1)
        (0.32414429233720543 0.09846738489321036 1)
        (0.27620806825331035 0.09620419611833195 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.23068325697392147 0.09202385576508385 0)
        (0.18810415385757218 0.08609769890412669 0)
        (0.1489645863489386 0.07865530211166527 0)
        (0.11370817130156673 0.06997348816262018 0)
        (0.08272068127102243 0.060361701179619635 0)
        (0.05632498132907304 0.05014452643259196 0)
        (0.03477864321144247 0.039642479806244725 0)
        (0.01827397456999423 0.029152435001794354 0)
        (0.0069398882956542285 0.018929165930684416 0)
        (0.0008448384007748238 0.009169448854163351 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.23068325697392147 0.09202385576508385 1)
        (0.18810415385757218 0.08609769890412669 1)
        (0.1489645863489386 0.07865530211166527 1)
        (0.11370817130156673 0.06997348816262018 1)
        (0.08272068127102243 0.060361701179619635 1)
        (0.05632498132907304 0.05014452643259196 1)
        (0.03477864321144247 0.039642479806244725 1)
        (0.01827397456999423 0.029152435001794354 1)
        (0.0069398882956542285 0.018929165930684416 1)
        (0.0008448384007748238 0.009169448854163351 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.004285838207330021 -0.008146604012849501 0)
        (0.013530170451851287 -0.014887532094324106 0)
        (0.02758676902995695 -0.020243187257246678 0)
        (0.046263545168326925 -0.024255021667463607 0)
        (0.06932840252634487 -0.026987446270798004 0)
        (0.09651587752170128 -0.02853010742205709 0)
        (0.1275337060056423 -0.028999818122016695 0)
        (0.16206849457537476 -0.028541383105461414 0)
        (0.19978986359476492 -0.027326616510573533 0)
        (0.24035273269911614 -0.02555102077638359 0)
    )
    spline 19 35
    (
        (0.004285838207330021 -0.008146604012849501 1)
        (0.013530170451851287 -0.014887532094324106 1)
        (0.02758676902995695 -0.020243187257246678 1)
        (0.046263545168326925 -0.024255021667463607 1)
        (0.06932840252634487 -0.026987446270798004 1)
        (0.09651587752170128 -0.02853010742205709 1)
        (0.1275337060056423 -0.028999818122016695 1)
        (0.16206849457537476 -0.028541383105461414 1)
        (0.19978986359476492 -0.027326616510573533 1)
        (0.24035273269911614 -0.02555102077638359 1)
    )
    spline 16 12
    (
        (0.28339778018905537 -0.023427864631221304 0)
        (0.3285504548179743 -0.021179739582669936 0)
        (0.37541918326883394 -0.019028045453411642 0)
        (0.423978286829447 -0.017102656694805166 0)
        (0.4737716942991388 -0.015078565938748255 0)
        (0.523897173547112 -0.012998841226611026 0)
        (0.5738574700590975 -0.010973134096994581 0)
        (0.6231508099119325 -0.009087449487958074 0)
        (0.67127603643397 -0.007401773940541839 0)
        (0.7177380683172313 -0.005950305533401427 0)
        (0.7620534863254778 -0.004743986730477635 0)
        (0.8037560958350968 -0.003774770708873703 0)
        (0.8424023720166297 -0.00302088892925801 0)
        (0.8775767515453576 -0.0024523499684868943 0)
        (0.9088967701574113 -0.0020359822761034617 0)
        (0.9360180479502401 -0.0017395121483051983 0)
        (0.958639093547271 -0.00153440422740921 0)
        (0.9765058439429919 -0.0013974399538115314 0)
        (0.9894157961056461 -0.0013112257688761798 0)
        (0.9972215386697629 -0.0012639723106533448 0)
    )
    spline 35 31
    (
        (0.28339778018905537 -0.023427864631221304 1)
        (0.3285504548179743 -0.021179739582669936 1)
        (0.37541918326883394 -0.019028045453411642 1)
        (0.423978286829447 -0.017102656694805166 1)
        (0.4737716942991388 -0.015078565938748255 1)
        (0.523897173547112 -0.012998841226611026 1)
        (0.5738574700590975 -0.010973134096994581 1)
        (0.6231508099119325 -0.009087449487958074 1)
        (0.67127603643397 -0.007401773940541839 1)
        (0.7177380683172313 -0.005950305533401427 1)
        (0.7620534863254778 -0.004743986730477635 1)
        (0.8037560958350968 -0.003774770708873703 1)
        (0.8424023720166297 -0.00302088892925801 1)
        (0.8775767515453576 -0.0024523499684868943 1)
        (0.9088967701574113 -0.0020359822761034617 1)
        (0.9360180479502401 -0.0017395121483051983 1)
        (0.958639093547271 -0.00153440422740921 1)
        (0.9765058439429919 -0.0013974399538115314 1)
        (0.9894157961056461 -0.0013112257688761798 1)
        (0.9972215386697629 -0.0012639723106533448 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
